import FAQ from "./FAQForms";
import React, { useState } from "react";

function FAQHomePage() {
  const [faqs, setFaqs] = useState([
    {
      question: "Яка вартість навчання за один рік?",
      answer:
        "Вартість навчання залежить від обраної спеціальності та форми навчання. Детальну інформацію можна знайти на сторінці з інформацією про вартість навчання на нашому сайті",
      open: true,
    },
    {
      question: "Чи є у вашому університеті підготовчі курси?",
      answer:
        "Так, університет пропонує підготовчі курси для абітурієнтів, які допоможуть підготуватися до вступних іспитів та покращити звання з необхідних предметів.",
      open: false,
    },
    {
      question: "Які можливості для студентів є для міжнародного обміну?",
      answer:
        "Університет має прогами міжнародного обміну з багатьма закордонними університетами. Студенти можуть взяти участь у програмах обміну, стажуваннях на літніх школах за кордоном",
      open: false,
    },
    {
      question: "Чи є в університеті стипендії для студентів?",
      answer:
        "Так університет надає академічні та соціальні степендії для студентів, які демонструють високі результати в навчанні або потребують фінансової підтримки",
      open: false,
    },
    {
      question: "Які документи потрібні для вступу іноземним студентам?",
      answer:
        "Іноземні студенти повинні подати копію паспорта, атестат про середню освіту з перекладом на українську мову, медичну довідку, сертифікат знання української мови (якщо є), та інші документи згідно з вимогами.",
      open: false,
    },
    {
      question: "Чи надає університет гуртожиток для студентів?",
      answer:
        "Так університет надає гуртожиток для студентів. Кількість місць обмежена, тому рекомендується подавати заявку на поселення заздалегідь",
      open: false,
    },
  ]);

  const toggleFAQ = (index) => {
    setFaqs(
      faqs.map((faq, i) => {
        if (i === index) {
          faq.open = !faq.open;
        } else {
          faq.open = false;
        }

        return faq;
      })
    );
  };

  return (
    <section className="App">
      <h1 className="faq-title">FAQ</h1>
      <div className="faqs">
        {faqs.map((faq, index) => (
          <FAQ faq={faq} index={index} key={index} toggleFAQ={toggleFAQ} />
        ))}
      </div>
    </section>
  );
}
export default FAQHomePage;
