import React from "react";

function Instruction() {
  return (
    <section className="instruction-container">
      <div>
        <h1 className="instructions-topic">Як потрапити на програму обміну</h1>
        <div className="instructions-text">
          <ol>
            <li>
              Оберіть програму обміну: Виберіть університет або програму обміну,
              яка відповідає вашим академічним та особистим інтересам.
            </li>
            <li>
              Дотримуйтеся вимог: Перевірте вимоги для участі в програмі обміну.
              Це може включати академічні критерії, рівень знання мови,
              фінансові обмеження та інші критерії.
            </li>
            <li>
              Подайте заявку: Заповніть заявку на участь в програмі обміну через
              відповідну платформу або веб-сайт університету. Дотримуйтеся всіх
              вказівок та дедлайнів.
            </li>
            <li>
              Підготуйте документи: Зазвичай вам потрібно буде надати додаткові
              документи, такі як рекомендаційні листи, заяву про навчання,
              оцінки, мотиваційний лист тощо.
            </li>
            <li>
              Пройдіть відбір: Ваша заявка буде розглянута комісією або
              відповідним відділом університету. Зазвичай відбір проводиться на
              конкурсній основі з урахуванням вашої академічної успішності,
              мотивації та інших критеріїв.
            </li>
            <li>
              Підготуйтеся до подорожі: Якщо ваша заявка схвалена, підготуйтеся
              до подорожі. Це може включати отримання візи, організацію житла та
              інші аспекти.
            </li>
            <li>
              Отримайте досвід: Під час обміну ви будете мати можливість вивчати
              нову культуру, поглиблювати знання та розвивати нові навички.
              Насолоджуйтеся цією неповторною можливістю!
            </li>
          </ol>
        </div>
      </div>
    </section>
  );
}

export default Instruction;
